# Стартуем с официального образа Go, используя версию, подходящую вам. Например, 1.20
FROM golang:1.22 as builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum в рабочую директорию
COPY go.mod go.sum ./

# Загружаем зависимости
RUN go mod download

# Копируем остальные файлы приложения
COPY . .

# Собираем приложение
RUN go build -o /api-gateway

# Используем меньший образ для финального контейнера
FROM gcr.io/distroless/base-debian11

# Копируем двоичный файл из предыдущего этапа
COPY --from=builder /api-gateway /api-gateway

# Уведомляем о порте, который будет использоваться
EXPOSE 8080

# Указываем команду для запуска приложения
CMD ["/api-gateway"]